#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```

data.aws_route53_zone.main_domain[0]: Reading...
data.aws_route53_zone.main_domain[0]: Read complete after 0s [id=Z0901806342JE97O6SZMG]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.app_certificate[0] will be created
  + resource "aws_acm_certificate" "app_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "dev-nextjs.stansk.com"
      + domain_validation_options = [
          + {
              + domain_name           = "dev-nextjs.stansk.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "dev-nextjs.stansk.com",
        ]
      + tags                      = {
          + "Environment" = "dev"
          + "Name"        = "dev-nextjs-formation-certificate"
        }
      + tags_all                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-nextjs-formation-certificate"
          + "Project"     = "nextjs-formation"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert_validation[0] will be created
  + resource "aws_acm_certificate_validation" "cert_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_cache_policy.app_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "app_cache_policy" {
      + arn         = (known after apply)
      + comment     = "Cache policy for nextjs-formation dev"
      + default_ttl = 86400
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 1
      + name        = "dev-nextjs-formation-cache-policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_distribution.app_distribution will be created
  + resource "aws_cloudfront_distribution" "app_distribution" {
      + aliases                         = [
          + "dev-nextjs.stansk.com",
        ]
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "dev nextjs-formation Distribution"
      + continuous_deployment_policy_id = (known after apply)
      + default_root_object             = "index.html"
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = true
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_100"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Environment" = "dev"
          + "Name"        = "dev-nextjs-formation-distribution"
        }
      + tags_all                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-nextjs-formation-distribution"
          + "Project"     = "nextjs-formation"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods          = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + cache_policy_id          = (known after apply)
          + cached_methods           = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress                 = false
          + default_ttl              = (known after apply)
          + max_ttl                  = (known after apply)
          + min_ttl                  = 0
          + origin_request_policy_id = (known after apply)
          + target_origin_id         = "S3-dev-nextjs-formation"
          + trusted_key_groups       = (known after apply)
          + trusted_signers          = (known after apply)
          + viewer_protocol_policy   = "redirect-to-https"
        }

      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = (known after apply)
          + origin_access_control_id = (known after apply)
          + origin_id                = "S3-dev-nextjs-formation"
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_control.app_oac will be created
  + resource "aws_cloudfront_origin_access_control" "app_oac" {
      + arn                               = (known after apply)
      + description                       = "OAC pour l'accès au bucket S3"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "dev-nextjs-formation-oac"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # aws_cloudfront_origin_request_policy.app_request_policy will be created
  + resource "aws_cloudfront_origin_request_policy" "app_request_policy" {
      + arn     = (known after apply)
      + comment = "Request policy for nextjs-formation dev"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "dev-nextjs-formation-request-policy"

      + cookies_config {
          + cookie_behavior = "none"
        }

      + headers_config {
          + header_behavior = "whitelist"

          + headers {
              + items = [
                  + "Access-Control-Request-Headers",
                  + "Access-Control-Request-Method",
                  + "Origin",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "all"
        }
    }

  # aws_route53_record.app_domain[0] will be created
  + resource "aws_route53_record" "app_domain" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev-nextjs.stansk.com"
      + type            = "A"
      + zone_id         = "Z0901806342JE97O6SZMG"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.cert_validation["dev-nextjs.stansk.com"] will be created
  + resource "aws_route53_record" "cert_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0901806342JE97O6SZMG"
    }

  # aws_s3_bucket.app_bucket will be created
  + resource "aws_s3_bucket" "app_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-nextjs-formation-app-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "dev-app-bucket"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-app-bucket"
          + "Project"     = "nextjs-formation"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_policy.app_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "app_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_versioning.app_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "app_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_bucket_website_configuration.app_website will be created
  + resource "aws_s3_bucket_website_configuration" "app_website" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + app_bucket_arn             = (known after apply)
  + app_bucket_name            = "dev-nextjs-formation-app-bucket"
  + cloudfront_distribution_id = (known after apply)
  + cloudfront_domain_name     = (known after apply)
  + dns_records                = {
      + parent_zone = "stansk.com"
      + records     = {
          + main = "dev-nextjs.stansk.com"
          + www  = null
        }
      + zone_id     = "Z0901806342JE97O6SZMG"
    }
  + domain_name                = "dev-nextjs.stansk.com"
  + environment                = "dev"
  + iam_policy_json            = jsonencode(
        {
          + Statement = [
              + {
                  + Action   = [
                      + "s3:ListBucket",
                      + "s3:GetObject",
                      + "s3:PutObject",
                      + "s3:DeleteObject",
                    ]
                  + Effect   = "Allow"
                  + Resource = [
                      + "arn:aws:s3:::dev-nextjs-formation-terraform-state",
                      + "arn:aws:s3:::dev-nextjs-formation-terraform-state/*",
                      + "arn:aws:s3:::prod-nextjs-formation-terraform-state",
                      + "arn:aws:s3:::prod-nextjs-formation-terraform-state/*",
                    ]
                },
              + {
                  + Action   = [
                      + "s3:CreateBucket",
                      + "s3:DeleteBucket",
                      + "s3:GetBucketVersioning",
                      + "s3:PutBucketVersioning",
                      + "s3:GetBucketPolicy",
                      + "s3:PutBucketPolicy",
                      + "s3:GetBucketWebsite",
                      + "s3:PutBucketWebsite",
                      + "s3:GetBucketTagging",
                      + "s3:PutBucketTagging",
                      + "s3:ListBucket",
                      + "s3:GetObject",
                      + "s3:PutObject",
                      + "s3:DeleteObject",
                      + "s3:PutBucketCORS",
                      + "s3:GetBucketCORS",
                    ]
                  + Effect   = "Allow"
                  + Resource = [
                      + "arn:aws:s3:::dev-nextjs-formation-app-bucket",
                      + "arn:aws:s3:::dev-nextjs-formation-app-bucket/*",
                      + "arn:aws:s3:::prod-nextjs-formation-app-bucket",
                      + "arn:aws:s3:::prod-nextjs-formation-app-bucket/*",
                    ]
                },
              + {
                  + Action   = [
                      + "cloudfront:CreateDistribution",
                      + "cloudfront:UpdateDistribution",
                      + "cloudfront:DeleteDistribution",
                      + "cloudfront:GetDistribution",
                      + "cloudfront:ListDistributions",
                      + "cloudfront:CreateCloudFrontOriginAccessIdentity",
                      + "cloudfront:GetCloudFrontOriginAccessIdentity",
                      + "cloudfront:DeleteCloudFrontOriginAccessIdentity",
                      + "cloudfront:CreateInvalidation",
                      + "cloudfront:GetInvalidation",
                      + "cloudfront:ListInvalidations",
                      + "cloudfront:CreateCachePolicy",
                      + "cloudfront:GetCachePolicy",
                      + "cloudfront:UpdateCachePolicy",
                      + "cloudfront:DeleteCachePolicy",
                      + "cloudfront:CreateOriginRequestPolicy",
                      + "cloudfront:GetOriginRequestPolicy",
                      + "cloudfront:UpdateOriginRequestPolicy",
                      + "cloudfront:DeleteOriginRequestPolicy",
                      + "cloudfront:CreateOriginAccessControl",
                      + "cloudfront:GetOriginAccessControl",
                      + "cloudfront:UpdateOriginAccessControl",
                      + "cloudfront:DeleteOriginAccessControl",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
              + {
                  + Action   = [
                      + "acm:RequestCertificate",
                      + "acm:DescribeCertificate",
                      + "acm:DeleteCertificate",
                      + "acm:ListCertificates",
                      + "acm:AddTagsToCertificate",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
              + {
                  + Action   = [
                      + "route53:ListHostedZones",
                      + "route53:GetHostedZone",
                      + "route53:ListResourceRecordSets",
                      + "route53:ChangeResourceRecordSets",
                      + "route53:CreateHealthCheck",
                      + "route53:GetHealthCheck",
                      + "route53:DeleteHealthCheck",
                      + "route53:UpdateHealthCheck",
                      + "route53:GetChange",
                    ]
                  + Effect   = "Allow"
                  + Resource = "*"
                },
            ]
          + Version   = "2012-10-17"
        }
    )
  + website_url                = "https://dev-nextjs.stansk.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
